
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Объект, Элементы)
	Если Объект.АутентификацияSMTP = ПредопределенноеЗначение("Перечисление.ВидНастройкиАутентификацииSMTP.РучнаяНастройка") Тогда
		Элементы.ПользовательSMTP.Доступность = Истина;
		Элементы.ПарольSMTP.Доступность = Истина;
	Иначе
		Элементы.ПользовательSMTP.Доступность = Ложь;
		Элементы.ПарольSMTP.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АутентификацияSMTPПриИзменении(Элемент)
	УстановитьДоступностьЭлементов(Объект, Элементы);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьДоступностьЭлементов(Объект, Элементы);	
КонецПроцедуры
