
//////////////////////////////////////////////////////////////////////
// Обработчики команд

&НаКлиенте
Процедура Сохранить()
	
	РаботаСХранилищемОбщихНастроек.СохранитьРабочийКаталог(ПутьКРабочемуКаталогу);
	РаботаСХранилищемОбщихНастроек.СохранитьТекстКраткогоЗаголовкаПриложения(КраткийЗаголовок);
	Если ПолучитьКраткийЗаголовокПриложения() <> КраткийЗаголовок Тогда
		
		УстановитьКраткийЗаголовокПриложения(КраткийЗаголовок);
		
	КонецЕсли;
	
	Закрыть(Истина);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПутьКРабочемуКаталогу = РаботаСХранилищемОбщихНастроек.ПолучитьРабочийКаталог();
	КраткийЗаголовок = РаботаСХранилищемОбщихНастроек.ПолучитьТекстКраткогоЗаголовкаПриложения();
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////
// Обработчики событий элементов управления

&НаКлиенте
Процедура ПутьКРабочемуКаталогуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПодключитьРасширениеРаботыСФайлами() Тогда

		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ДиалогОткрытияФайла.Заголовок = НСтр("ru ='Выбор каталога временного хранения файлов'", "ru");
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			ПутьКРабочемуКаталогу = ДиалогОткрытияФайла.Каталог;
		КонецЕсли;
		
	Иначе
		
		Предупреждение(НСтр("ru ='Данная возможность недоступна, так как не подключено расширение работы с файлами.'", "ru"));
		
	КонецЕсли;
	
КонецПроцедуры
